app/services/address_creator.rb

INSERT INTO "addresses" ("public_place", "complement", "district", "locality", "state", "ibge", "gia", "area_code", "siafi", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def call
    customer.create_address(filtered_attributes) if filtered_attributes