app/workers/customer_address_fetcher.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def perform(customer_zip_code, customer_id)
    response_address = ViacepHandler.call(customer_zip_code)
    customer = Customer.find_by(id: customer_id)