app/controllers/api/v1/bulk/customer_controller.rb

INSERT INTO "customers" ("zip_code", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["zip_code", "01001000"], ["name", "JOSE"], ["created_at", "2022-12-22 17:20:02.054581"], ["updated_at", "2022-12-22 17:20:02.054581"]]
---
  def create
    created_customers = customer_params.map do |customer_param|
      customer = Customer.new(zip_code: customer_param[:cep], name: customer_param[:name],)
      CustomerAddressFetcher.perform_async(customer.zip_code, customer.id ) if customer.save